let dataText = `9c773adf-911b-479e-9cbb-960442d8425b,6世紀の西アジアに建国した朝は何？,ササン朝,,カスピ海東南部にあったパルティア（中国名:安息）を倒し建国したのが、農耕イラン人のササン朝（224〜651年）,0,0
4da2aae1-494f-442c-ab69-86c15ad50b1f,ササン朝を建国したのは誰？,アルダシール1世,,,0,0
be70ad03-2b01-46e1-bef4-6c813d9a7158,ササン朝の国教は何？,ゾロアスター教,,,0,0
d69a1a1e-8e8b-47c7-8caa-27147392e9fb,6世紀、東地中海地域を支配した帝国は？,ビザンツ帝国（東ローマ帝国）,,,0,0
11a3f21e-50ae-4c02-b636-d2ddc1fb5583,7世紀前半、アラブ人諸民族の間に広まった宗教は？,イスラーム教,,イスラーム教はユダヤ教やキリスト教の系譜のうえに生まれた宗教で、メッカの名家クライシュ族に生まれた、ムハンマドによってとなえられた。,0,0
374a252d-8a9c-4b64-bc61-f2ed8c66b778,イスラーム教をつくったのは誰？,ムハンマド,,,0,0
e399d599-f5c8-4f9f-af4d-77cfce935b17,ムハンマドは、自らを唯一神アッラーの言葉を預けられた、〇〇〇と考えていた。〇に入る言葉は何？,預言者,,,0,0
20451599-68e4-4bae-8da7-3d5c915096ad,ムハンマドはメッカの有力者たちに迫害にあい、622年にメディナに移住した。この移住は何と呼ばれていた？,ヒジュラ,,,0,0
27a49c97-05d5-4b74-a744-85c006fed741,イスラーム教徒の共同体は別名何と言う？,ウンマ,,,0,0
799add8b-0e02-4d65-90f9-bd7e43989fc3,前612年、オリエントにエジプト、リディア、新バビロニア、〇〇の4王国が誕生した。〇〇に入る国名は何？,メディア,,,0,0
6133c9a4-555b-4fe4-bd64-3e252476b99b,ムハンマドの後継者は何と呼ばれた？,カリフ,,,0,0
85636038-9d6a-4f95-aeaa-5de2e663ddc9,初代カリフは誰？,アブー=バクル,,スンナ派の正統カリフ（初代）,0,0
adfc5520-7c48-4f98-8f78-1d90bb5e6531,第2代カリフは誰？,ウマル,,スンナ派の正統カリフ（2代目）,0,0
596f51f1-0957-4b0c-9e21-d52d664b0693,3代目カリフは誰？,ウスマーン,,スンナ派の正統カリフ（3代目）,0,0
a8f63180-2ed3-453f-a6fa-811bcf2a9991,第4代カリフは誰？,アリー,,スンナ派の正統カリフ（4代目）,0,0
e865060c-407d-4dc4-a852-ea014c4d6811,ササン朝を滅ぼしたカリフは誰？,ウマル,,ササン朝を滅ぼしたことで、イラク・イランを獲得した,0,0
c180b263-1b73-47d6-9fba-ed0d8d2cd2f7,イスラームの多数派の派閥は何派と呼ばれている？,スンナ派,,ウマイヤ朝を支持し、預言者の言行（スンナ）に従う人々とされ、のちにスンナ派と呼ばれるようになった。,0,0
e29e6dd1-418f-4f42-85bc-71f6fc273c1d,イスラーム勢力が支配した土地につくられた軍営都市は何と呼ばれていた？,ミスル,,,0,0
53b5dd2f-4cf1-49da-a05c-42028a6ce871,4代目カリフのアリーと対立し、カリフを名乗っていたシリア総督は誰？,ムアーウィヤ,,ムアーウィヤはスンナ派,0,0
3e104906-1a3d-4645-a361-0888b08c39f6,ムアーウィヤが開いた朝は何朝？,ウマイヤ朝,,,0,0
60540f44-b524-47b5-91bb-0ac7c824e09c,ウマイヤ朝の首都はどこ？,ダマスクス,,,0,0
354eba8c-2bc7-4b9d-b156-ff2f5838900e,イスラーム勢力はイベリア半島に進出し、どの王国を滅ぼした？,西ゴート王国,,711年に西ゴート王国は滅ぼされた。,0,0
f3f02b1e-c8f5-4754-be44-ec1ef823fc37,イスラーム勢力はフランク王国内へ進出したが、ある戦いで敗れ、撤退した。その戦いは何？,トゥール・ポワティエ間の戦い,,732年にトゥール・ポワティエ間の戦いに敗れ、イスラーム勢力の拡大はイベリア半島に留まった。,0,0
6b761e54-e311-48f6-bb9e-ec29d5792ff5,ウマイヤ朝は被征服地の人々から人頭税を徴収した。人頭税の別名は何？,ジズヤ,,,0,0
fc095381-8180-4213-b2a6-234bb6dd9f69,ウマイヤ朝の土地税の別名は？,ハラージュ,,,0,0
b90522e2-2805-45e3-b472-e11a4cca21f5,750年にアッバース家がウマイヤ朝を滅ぼし開いた朝は？,アッバース朝,,ムハンマドの叔父の子の子孫がアッバース家。,0,0
892195c0-b8e3-4e54-b423-9d825ae7f5e6,人頭税と呼ばれるウマイヤ朝の税金は何？,ジズヤ,,,0,0
fe225247-b1aa-4813-82af-095ed11dc28a,アッバース朝の首都はどこ？,バグダート,,バグダートはティグリス川西岸に建設された3重の城壁を持つ円形の都。城内にはカリフとその一族の住居・官庁・軍隊の詰め所などがあり、商人や職人はその外側に居住区を作って住んでいた,0,0
0df241a0-3170-4448-a312-fab4027c59cf,イスラム教徒の商人のことを何と言う？,ムスリム商人,,アッバース朝により広大な地域が統合され、交通路の安全が確保されたことでバグダートと各地を結ぶ交易が発達した。,0,0
e6357ffe-c7e5-4127-9ce4-c91765381df5,アッバース朝最盛期の支配者は誰？,ハールーン=アッラシード,,,0,0
8fbf9def-29fa-4dcd-af86-e73727a62b20,アラビア数字はどこの国の数学を元にしている？,インド,,,0,0
d020f38a-2787-4c34-a265-699206a100a2,バグダートの「知恵の館」の別名は？,バイト=アルヒクマ,,知恵の館を中心にギリシア語による医学、天文学、幾何学、倫理学、哲学の文献が盛んにアラビア語に翻訳された,0,0
b89296d9-e0c4-466c-8ce9-a642e46440f7,イスラーム神学の形成において重要な役割を果たしたのは誰の哲学？,アリストテレス,,プラトンの弟子で、経験と観察を重んじ、自然・人文・社会のあらゆる方面に思索を及ぼした。「万学の祖」と呼ばれた彼の学問体系はスコラ学に大きな影響を与えた。,0,0
eb36ccb7-c458-405b-961d-bfdd0fdc256a,教会の権威の理論的確立のため、信仰を論理的に体系化しようとしたのは何学？,スコラ学,,中世西ヨーロッパ特有の学問,0,0
d9302479-e062-4b56-a4c0-2ee9b916e111,イスラーム教の聖典「コーラン」の別名は？,クルアーン,,,0,0
42b3d205-a361-4d4c-a5c1-b9347ac9bed6,聖典「コーラン」に記された、6つの信じるべきこと、5つの実践すべきことをまとめたものを何という？,六信五行,,六信とは①神、②天使、③各種の啓典、④預言者たち、⑤来世、⑥神の予定を信じることであり、五行は①信仰告白、②礼拝、③喜捨（きしゃ）、④断食、⑤メッカ巡礼を実施すること,0,0
805fc009-9f16-4aa3-9891-8fbe7e48c067,イスラーム法の別名は？,シャリーア,,ムハンマドが示した生き方を理想とし、それを基準に現実の問題に対応する法の体系がイスラーム法,0,0
6e4c2cb7-a7a7-49d2-b472-3fe985ebb6d2,イスラーム法学者を別名なんという？,ウラマー,,,0,0
6d45a0da-65b3-4fda-b5c2-dfbec973a03a,アラビアン=ナイトの別名は？,千夜一夜物語,,アラビア言語学が発達し、インド・イラン・アラビア・ギリシアなどに起源をもつ説話を集め、まとめたもの。,0,0
8327990e-9dec-4342-9e11-794b5fbb039e,イスラーム教は偶像崇拝をしてもよい？よくない？,よくない,よい,,0,0
e235cdfa-3e38-42e0-8813-87b1c5809a87,モスクとは何？,イスラーム教徒が神への礼拝を行う場所,,,0,0
d8e490c4-baf7-424f-b08e-c616d750ce93,モスクなどで用いられる、植物や文字を文様化した装飾は何と呼ばれる？,アラベスク,,,0,0
53ab9d4e-ee43-4b33-8539-689e866f81b2,西アジアならびに周辺地域の文化とイスラーム教、そしてアラビア語が融合した文化を何と言う？,イスラーム文化,,イスラーム教が各地に伝播するにつれ、地域ごとの言語・文化的な特色が加わり、イラン=イスラーム文化やトルコ=イスラーム文化、インド=イスラーム文化などが成立した。,0,0
7de2b38d-3e66-49d2-b5ba-12035fd8b2ae,シリアのウマイヤ朝滅亡後、その一族が開いた朝は？,後ウマイヤ朝,,イベリア半島に逃れ、コルドバを都に後ウマイヤ朝を開いた。,0,0
396a4300-35f4-4d31-95be-9aa98439a86b,後ウマイヤ朝の成立により、アラブ=ムスリム軍の征服でつくられたイスラーム政権で何が始まった？,分裂,,この動きはエジプトのトゥールーン朝や、中央アジアのサーマーン朝など、アッバース朝周辺地域に地方政権が自立することで加速した。,0,0
db8c8a5f-8070-4967-a1ef-899fc1668f26,10世紀後半、北アフリカにおこったシーア派の朝は？,ファーティマ朝,,,0,0
91d6c2b6-e822-4a06-9192-e895f86b19d9,10世紀のアッバース朝ではトルコ系の何が台頭していた？,マムルーク（軍人奴隷）,,これにより、カリフの権力が弱まっていった,0,0
e8a7688f-77c0-48b0-97c8-7bd2db6606eb,シーア派のイラン系軍事政権は何朝？,ブワイフ朝,,アッバース朝のカリフの権力の弱体化に乗じ、バグダートに入城しアッバース朝カリフを意のままに操った。,0,0
e924544a-6712-4cd4-ad1a-bc668fb9f042,アミールとは何？,軍司令官,,,0,0
23891b9e-e2e4-4eab-b365-468e97692ef6,ヨーロッパでは前6世紀頃から何人が住み着いていた？,ケルト人,,,0,0
e0b6a61d-723a-4180-98b0-81f8b5035e69,バルト海沿岸を原住地とするのは何人？,ゲルマン人,,,0,0
4ae41149-c472-457d-a94c-54b12ca42ed5,ケルト人を西に圧迫しながら勢力を拡大したのは何人？,ゲルマン人,,,0,0
8a89cd2d-36b4-4ed2-a54e-55ea3c6dd086,ゲルマン人の重要な決定を行うためにする成年男子自由人の全体集会は何？,民会,,民会とは、言葉の通り民が行う集会である。平民だけの平民会もある。基本的に成人男性が参加する。,0,0
60fdae74-cba3-4c3b-b7af-8d847eb61d0d,都市から逃げ出した下層市民などを小作人呼ぶが、もう一つの呼び方は何？,コロヌス,,,0,0
59ef2156-4472-4e4d-a411-617e454edcd2,小作人（コロヌス）が大所領と呼ばれる土地で働く生産体制をなんと呼ぶ？,小作制（コロナトゥス）,,,0,0
d2d0330c-8f4d-4a04-a470-e9d4b35baa4d,4世紀後半、アジア系の何人がドン川を超え、西へと進んだ？,フン人,,,0,0
63bc8715-e033-4c01-9044-206a0120272c,4世紀後半、アジア系のフン人は西へ進み、ゲルマン人の一派である何人の大半を征服した？,東ゴート人,,東ゴート人が征服され、フン人が西へと進出してきたことで、西ゴート人も圧迫された。,0,0
6ae15342-9c69-46d4-a62c-be2c7b4ee2ff,西に追いやられた西ゴート人は375年に南下を始めた。これをきっかけに他のゲルマン諸民族も大規模な移動を開始した。この移動を何と言う？,ゲルマン人の大移動,,約200年にも及ぶほどの大移動だった。,0,0
4b15dafb-b533-4e1f-9ab6-09817b707512,西ゴート人はローマ略奪の後、ガリア西南部とイベリア半島に移動し建国した、その国名は？,西ゴート王国,,,0,0
7469231d-f18a-45d1-97c6-6574ede07e62,ヴァンダル人は北アフリカに何王国を建国した？,ヴァンダル王国,,,0,0
fb9cff03-0654-43ac-984b-d596dd423fd4,ブルグンド人はガリア東南部に何王国を建国した？,ブルグンド王国,,,0,0
590f7814-b855-4b3a-9e28-59f01f882867,フランク人がガリア北部に建国した王国名は？,フランク王国,,,0,0
4bac6a0e-6cf0-45a4-b440-3cead47e5815,大ブリテン島（現イギリス）に渡り、建国したのは何人？,アングロ=サクソン人,,,0,0
a63c8fe5-9797-44d5-a613-3d637e8d3487,アングロ=サクソン人は大ブリテン島に何王国を建国した？,アングロ=サクソン七王国,,別名、ヘプターキー,0,0
29470f1d-baa2-4fca-bdb3-b1f1dfabf06b,5世紀前半、パンノニア（現ハンガリー）を中心に大帝国を建国したフン人の王は誰？,アッティラ王,,在位433〜453,0,0
9a60e9ba-e515-474a-8ed0-d46ea0078262,アッティラ王が西ローマ帝国とゲルマンの連合軍に敗れ、大帝国崩壊の一歩となった戦いは？,カタラウヌムの戦い,,,0,0
5d5e3821-af48-4a0d-8aee-e4792a98dff9,アッティラ王の大帝国崩壊の混乱の中で、西ローマ帝国が476年に滅ぼされた。滅ぼしたのは誰？,オドアケル,,オドアケルはゲルマン人傭兵隊長。西ローマ帝国滅亡の年は「476（死なむ）ローマ」で覚える。,0,0
dd202380-213a-448e-86f8-908319bead49,テオドリック大王率いる東ゴート人は、ビザンツ（東ローマ）皇帝の命令で、イタリア半島の王国を倒した。倒したのは誰の王国？,オドアケル,,,0,0
d2d1e4a6-793b-4905-b3ce-04040dbe84e4,568年テオドリック大王率いる東ゴート人は北イタリアに何王国を建国した？,ランゴバルド王国,,ランゴバルド王国建国を最後に375年から始まった、ゲルマン人の大移動は一応の終息となった。,0,0
86aeea48-a03f-4310-8e8f-cb330b04e5f0,711年、アラビア半島から急速に広まったイスラーム勢力は、ウマイヤ朝時代にイベリア半島の何王国を滅ぼした？,西ゴート王国,,,0,0
63229cbc-a7ee-4eba-b136-ada12cdfba93,東欧やロシアに広まった、「正統」を主張したキリスト教は何教と呼ばれる？,正教,,,0,0
0b59ab07-2704-472e-b75d-a228b5a03956,ビザンツ（東ローマ）帝国の首都はどこ？,コンスタンティノープル,,旧名、ビザンティウム,0,0
34d0a40f-4404-486c-a048-3267ebb849c0,コンスタンティノープルにあるキリスト教の教会は何教会？,コンスタンティノープル教会,,キリスト教には五本山と呼ばれる教会があり、ローマ・コンスタンティノープル・アンティオキア・イェルサレム・アレクサンドリアのそれぞれが5つの管区に分けられた信徒を指導した。,0,0
9de191d1-c8e5-4301-8a64-143c390edaf2,ビザンツ帝国は巨大な官僚制による何支配を維持していた？,皇帝専制支配,,ビザンツ皇帝はコンスタンティノープル教会を中心に、地上におけるキリストの代理人としてギリシア正教会を支配し、政治と宗教両面における最高権力者であった。,0,0
a1f94754-b2a5-48b4-9468-96126a889a61,地中海帝国の復興をはかり、ヴァンダル王国や東ゴート王国を滅ぼし、一時的に地中海のほぼ全域を支配した帝は？,ユスティニアヌス大帝,,彼はローマ法大全や、ハギア=ソフィア聖堂の建設に力を注ぐ、中国から養蚕技術を取り入れ、絹織物産業の発展の基礎を築くなどのことを成した。,0,0
4f912900-8bf2-4fd5-ae9a-c3c819ee57c6,ゲルマン諸国家の大半は短命だったが、着実に領土を広げ、大きくなっていた国は？,フランク王国,,最有力国として西ヨーロッパ世界の形成に大きな役割を果たした。,0,0
aeaae024-29ef-4c6e-9980-143561a85d94,481年、フランク王に即位したのは誰？,クローヴィス,,,0,0
c96b7847-6ea8-4215-a65b-57cf682996d2,481年、クローヴィスがフランク王に即位し、開いた朝は？,メロヴィング朝,,その後、全フランクを統一し、ガリア中部を支配下においた。,0,0
9dafed6d-fdff-450c-b6a6-3cd4192604fe,5世紀後半、ゲルマン人の多くが何派のキリスト教を信仰していた？,アリウス派,,キリストを神と同一視したのがアタナシウス派、キリストを人間であるとしたのがアリウス派。アタナシウス派が正統教義とされ、アリウス派は異端とされていた。,0,0
f14a15c4-86cf-4b73-b924-d0a8c1017980,クローヴィスは宗教を改宗したが、アリウス派、アタナシウス派のどちらに改宗した？,アタナシウス派,,これにより、アタナシウス派を信仰していたローマ人貴族を支配層に取り込み、西ヨーロッパの中心勢力になる一因となった。,0,0
a6a772e2-2630-4cfd-a2c1-86ff4b9063c2,6世紀半ば、フランク王国は何王国を滅ぼし、全ガリアを統一した？,ブルグンド王国,,,0,0
7d70ea50-1e9d-417a-a430-78b83b851c90,8世紀、メロヴィング朝の権力が衰え、王家の財政・行政の長官である宮宰（きゅうさい）が実権を掌握した。この宮宰は誰？,マヨル=ドムス,,,0,0
81484efa-624b-47fd-95e0-450ab7ea1de3,8世紀、イスラーム勢力がガリアに侵攻しようとしたがメロヴィング朝の宮宰が撃退した。この宮宰は誰？,カール=マルテル,,,0,0
6f24fd5e-4054-4d77-8db3-a0095069d2b3,ガリアに侵攻しようとしたイスラーム勢力をカール=マルテルは何の戦いで撃退した？,トゥール・ポワティエ間の戦い,,732年にこの戦いでイスラーム勢力を撃退し、西方キリスト教世界を外部勢力から守った。,0,0
ad274842-32c7-490f-aca7-16c6c69a5420,カール=マルテルの子、ピピンは751年メロヴィング朝を廃して王位につき新たな朝を開いた。その朝は何？,カロリング朝,,,0,0
05b9fc3d-f725-4061-a1c0-7abfb890b47a,フランク王国と協同し西ヨーロッパ世界の形成に貢献した教会は？,ローマ=カトリック教会,,五本山の中でローマ教会とコンスタンティノープル教会が最有力だったが、西ローマ滅亡後、ローマ教会はコンスタンティノープル教会から分離する様子を見せた。,0,0
8d4d6ce5-8be2-4136-bba5-6117f9ba7f1a,6世紀末、ローマ教会でゲルマン人への布教を熱心に行った教皇は誰？,グレゴリウス1世,,,0,0
b8bf66d8-5137-4291-ba91-b962b92ef669,修道院で厳しい戒律を修道士に課し、「祈り、働け」の考えがあり、この考えを広めた運動を何という？,修道院運動,,,0,0
63013fa6-df4a-4b6c-9ed3-8886f8ac74af,キリスト教は偶像崇拝が可能だったが、偶像崇拝を禁じた初期の教理に反することなどから726年にある令が出された。その命令は？,聖像禁止令,,ビザンツ帝国レオン3世が発布した。禁止令発布の他の理由には、偶像を厳しく否定するイスラーム教からの批判にこたえる必要にせまられたのもある。,0,0
73ef43e6-f76f-4649-9034-e1baa6af5420,ローマ教皇はカール=マルテルの子ピピンがフランク王位を継承するのを認めた。その返礼にピピンは奪ったイタリアのラヴェンナ地方に教皇に寄進した。これを何と呼ぶ？,ピピンの寄進,,カール=マルテルがイスラーム軍を破り、西方キリスト教世界を守ったことを受け、ローマ教皇はフランク王国に接近をはかった。そのために、フランク王国の王位継承をピピンに認めた。そのお礼として、ピピンはイタリアのランゴバルド王国改め、ラヴェンナ地方を教皇にプレゼントした。,0,0
32a08e2f-4bcd-4117-a0d4-86a3dae70686,ローマ教皇はピピンの寄進により、ラヴェンナ地方という領土を手に入れた、これは何領？,教皇領,,利害が合致したローマ教会とフランク王国はこれにより、さらに結びつきを強めた。,0,0
fceefc82-a2c4-4703-828e-93fc84d3e7bc,ピピンの子は何帝？,カール大帝,,名前はシャルルマーニュ。,0,0
e588898c-5a78-4d5c-81cb-e88fbd63c593,カール大帝は北東の何人を服従させた？,ザクセン人,,,0,0
f543fbae-27aa-43db-96c2-5f026e0d87a6,カール大帝は東の何人を撃退した？,アヴァール人,,アルタイ語系の民族,0,0
209728e7-41a4-4cb0-927a-0e00ce169e32,カール大帝は南の何の勢力を撃退した？,イスラーム勢力,,,0,0
6e47e86e-632f-41f0-836d-7a5fe06a9d15,カールは広大な領土を集権的に支配するため、全国をどう分けた？,州に分けた,,,0,0
9d2e28a2-53cd-48bd-8b3d-aa78b8483901,カールは広大な領土を州に分けた後、地方の有力豪族を各州の長官として何に任命した？,伯,,さらに、この伯を監督するために、巡察使と呼ばれる者を派遣した。これにより、フランク王国はビザンツ帝国に並ぶ強大国となった。,0,0
7953c70b-d022-4e58-bbe2-509db5298246,カールはアルクインらの学者を多数まねき、ラテン語による文芸復興を行った。これをなんという？,カロリング=ルネサンス,,アルファベットの小文字が開発されたのもこの時期である。カール大帝は熱心にラテン語を学び、母国語を話すのと同じくらいに精通していた。,0,0
e77a6d3e-4f2d-4a11-a518-7a4fa4b5b83e,ローマ教会は、カールがビザンツ皇帝に対抗しうる〇〇だと認めた。〇〇に入る言葉は？,政治的保護者,,,0,0
cd51d017-ac42-4ead-b0f9-9a0eb58a7d39,800年のクリスマスの日教皇レオ3世はカールに何の帝冠を与えた？,ローマ皇帝の帝冠,,カールの戴冠とも呼ばれる。これは、西ローマ帝国の復活を表し、西ヨーロッパ世界が政治的・文化的・宗教的に独立したという重要な歴史的意義をもつ。,0,0`

let keys = "questionId,question,answers,wrongChoices,explanation,ordered,generatedWrongChoices".split(',');

let tempData = [];
let step1 = dataText.split('\n');
for (let i = 0; i < step1.length; i++) {
    let step2 = step1[i].split(',');
    let array = {};
    array['number'] = i + 1;
    array['question'] = step2[1];
    array['answer'] = step2[2]
    tempData.push(array);
}
questions_template['worldHistory1'] = tempData;